#define _CRT_SECURE_NO_DEPRECATE 0
#include<stdio.h>
#include<stdlib.h>
typedef struct student
{
	int num;
	struct student *next;
}stu;
void menu()
{
	printf("********************************************     0.登录系统     **********************************************\n");//包含注册和登录、学生登陆、老师登录
	printf("\n");
	printf("********************************************   1.添加学生信息   **********************************************\n");////创建链表（打印里面的内容、在面插入新的内容、删除里面的内容）
	printf("\n");
	printf("********************************************   2.修改学生信息   **********************************************\n");//选择性修改
	printf("\n");
	printf("********************************************   3.查找学生信息   **********************************************\n");//支持模糊查找
	printf("\n");
	printf("*******************************************      4.退出系统     **********************************************\n");
}
int main()
{
	menu();
	return 0;
}